Tekla Open API Reference for Tekla Structures 2025
RadiusDimensionAttributes Properties
The RadiusDimensionAttributes type exposes the following members.
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Color
 The color of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Format
 The format attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Placing
 The placing attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Text
 The text attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
TransparentBackground
 The dimension text background transparency. (transparent/opaque)
 (Inherited from DimensionSetBaseAttributes.)
TrueColor
 The true color (RGB enabled) of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Top
See Also
Reference
RadiusDimensionAttributes Class
Tekla.Structures.Drawing Namespace